mxq1688/esp/idf/projects/esp32-s3/audio_speaker/sdkconfig.defaults
# ESP32-S3 Audio Speaker SDK配置

# 目标芯片
CONFIG_IDF_TARGET="esp32s3"

# 串口波特率
CONFIG_ESPTOOLPY_BAUD_115200B=y
CONFIG_ESPTOOLPY_BAUD=115200

# FreeRTOS配置
CONFIG_FREERTOS_HZ=1000

# 日志级别
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

# Flash大小
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# 启用I2S
CONFIG_SOC_I2S_SUPPORTED=y

